app/controllers/categories_controller.rb

SELECT * FROM "categories" ORDER BY name LIMIT 30 OFFSET 0
SELECT count(*) AS count_all FROM "categories"
---
  def index
    @categories = Category.paginate :page => params[:page], :order => 'name'